In [2]:
import numpy as np
import pandas as pd

In [7]:
labels = ['a','b','c']
mylist=[10,20,30]
arr = np.array(mylist)
d = {'a':10,'b':20,'c':30}

In [8]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','CZ','Norway'])

In [13]:
ser1['USA']

1

In [14]:
ser2 = pd.Series([1,3,4,7],['USA','Germany','Sweden','Norway'])

In [15]:
ser1+ser2

CZ          NaN
Germany     5.0
Norway     11.0
Sweden      NaN
USA         2.0
dtype: float64

In [16]:
np.random.seed(101)
rand_mat = np.random.randn(5,4)

In [17]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [29]:
df = pd.DataFrame(rand_mat,index='A B C D E'.split(),columns='W X Y Z'.split())

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
list_col=['W','X']
type(df[list_col])

pandas.core.frame.DataFrame

In [35]:
df['V']=df['W']+df['Y']

In [39]:
df.drop('V',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df.drop(['D','E'])

          W         X         Y         Z         V
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355

In [44]:
df.loc[['A','E']]

          W         X         Y         Z         V
A  2.706850  0.628133  0.907969  0.503826  3.614819
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [43]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
V    3.614819
Name: A, dtype: float64

In [46]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [51]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z         V
A  2.706850  0.628133  0.907969  0.503826  3.614819
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [52]:
df.reset_index()

  index         W         X         Y         Z         V
0     A  2.706850  0.628133  0.907969  0.503826  3.614819
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4     E  0.190794  1.978757  2.605967  0.683509  2.796762

In [53]:
new_index = 'CA NY WY OR CO'.split()

In [56]:
df['States']=new_index
df.set_index('States')

               W         X         Y         Z         V
States
CA      2.706850  0.628133  0.907969  0.503826  3.614819
NY      0.651118 -0.319318 -0.848077  0.605965 -0.196959
WY     -2.018168  0.740122  0.528813 -0.589001 -1.489355
OR      0.188695 -0.758872 -0.933237  0.955057 -0.744542
CO      0.190794  1.978757  2.605967  0.683509  2.796762

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 6 columns):
W         5 non-null float64
X         5 non-null float64
Y         5 non-null float64
Z         5 non-null float64
V         5 non-null float64
States    5 non-null object
dtypes: float64(5), object(1)
memory usage: 440.0+ bytes

In [58]:
df.dtypes

W         float64
X         float64
Y         float64
Z         float64
V         float64
States     object
dtype: object

In [59]:
df.describe()

              W         X         Y         Z         V
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871  0.796145
std    1.681131  1.061385  1.454516  0.594708  2.265550
min   -2.018168 -0.758872 -0.933237 -0.589001 -1.489355
25%    0.188695 -0.319318 -0.848077  0.503826 -0.744542
50%    0.190794  0.628133  0.528813  0.605965 -0.196959
75%    0.651118  0.740122  0.907969  0.683509  2.796762
max    2.706850  1.978757  2.605967  0.955057  3.614819

In [60]:
ser_w = df['W']>0

In [62]:
ser_w.value_counts()

True     4
False    1
Name: W, dtype: int64

In [63]:
sum(ser_w)

4

In [64]:
len(ser_w)

5

In [65]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [67]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [68]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [69]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [70]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [72]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [74]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [78]:
df.groupby(['A']).size()

A
1.0    1
2.0    1
dtype: int64

In [79]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [80]:
df = pd.DataFrame(data)

In [81]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [87]:
df.groupby(['Company']).describe().T

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [88]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [90]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [91]:
df['col2'].unique()

array([444, 555, 666])

In [92]:
df['col2'].nunique()

3

In [93]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [97]:
newdf = df[(df['col1']>2)&(df['col2']==444)]

In [98]:
newdf

   col1  col2 col3
3     4   444  xyz

In [99]:
def times_two(number):
    return number*2

In [100]:
times_two(2)

4

In [103]:
df['new']=df['col1'].apply(times_two)

In [104]:
del df['new']

In [105]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [106]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [107]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [109]:
df.sort_values('col2',ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [113]:
df = pd.read_csv('/Users/stanislavprihoda/Documents/Code/Courses/Python_and_ML_courses/Timeseries_Python/_sources/TSA_COURSE_NOTEBOOKS/02-Pandas/example.csv')

In [115]:
newdf = df[['a','b']]

In [116]:
newdf.to_csv('mynew.csv',index=False)

In [120]:
df = pd.read_excel('/Users/stanislavprihoda/Documents/Code/Courses/Python_and_ML_courses/Timeseries_Python/_sources/TSA_COURSE_NOTEBOOKS/02-Pandas/Excel_Sample.xlsx',sheet_name='Sheet1')

In [121]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [125]:
my_list_of_tables = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [126]:
type(my_list_of_tables)

list

In [127]:
len(my_list_of_tables)

1

In [128]:
df = my_list_of_tables[0]

In [130]:
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 18, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

## Excercises

In [146]:
pop = pd.read_csv('_sources/TSA_COURSE_NOTEBOOKS/Data/population_by_county.csv')

In [147]:
pop.head()

             County           State  2010Census  2017PopEstimate
0  Abbeville County  South Carolina       25417            24722
1     Acadia Parish       Louisiana       61773            62590
2   Accomack County        Virginia       33164            32545
3        Ada County           Idaho      392365           456849
4      Adair County            Iowa        7682             7054

In [137]:
pop.columns

Index(['State', '2010Census', '2017PopEstimate'], dtype='object')

In [138]:
pop['State'].nunique()

51

In [143]:
pop['State'].unique()

array(['South Carolina', 'Louisiana', 'Virginia', 'Idaho', 'Iowa',
       'Kentucky', 'Missouri', 'Oklahoma', 'Colorado', 'Illinois',
       'Indiana', 'Mississippi', 'Nebraska', 'North Dakota', 'Ohio',
       'Pennsylvania', 'Washington', 'Wisconsin', 'Vermont', 'Minnesota',
       'Florida', 'North Carolina', 'California', 'New York', 'Wyoming',
       'Michigan', 'Alaska', 'Maryland', 'Kansas', 'Tennessee', 'Texas',
       'Maine', 'Arizona', 'Georgia', 'Arkansas', 'New Jersey',
       'South Dakota', 'Alabama', 'Oregon', 'West Virginia',
       'Massachusetts', 'Utah', 'Montana', 'New Hampshire', 'New Mexico',
       'Rhode Island', 'Nevada', 'District of Columbia', 'Connecticut',
       'Hawaii', 'Delaware'], dtype=object)

In [153]:
pop.sort_values('2010Census',ascending=False).head()

                  County       State  2010Census  2017PopEstimate
1713  Los Angeles County  California     9818605         10163507
628          Cook County    Illinois     5194675          5211263
1209       Harris County       Texas     4092459          4652980
1784     Maricopa County     Arizona     3817117          4307033
2501    San Diego County  California     3095313          3337685

In [158]:
pop.groupby('State').sum().sort_values('2010Census',ascending=False).head(5)

            2010Census  2017PopEstimate
State
California    37253956         39536653
Texas         25145561         28304596
New York      19378102         19849399
Florida       18801310         20984400
Illinois      12830632         12802023

In [186]:
pop['State'].nunique()

51

In [164]:
len(pop[pop['2010Census']>1000000])

39

In [200]:
sum(pop['2010Census']>1000000)

39

In [172]:
len(pop[pop['County'].apply(lambda x: False if 'county' in x.lower() else True)])

135

In [192]:
pop['Percent change 2010 2017'] = (pop['2017PopEstimate']/pop['2010Census'])-1

In [201]:
pop['2_percchange'] = 100*(pop['2017PopEstimate']-pop['2010Census'])/pop['2010Census']

In [202]:
pop.head()

,County,State,2010Census,2017PopEstimate,Percent change 2010 2017,2_percchange
0,Abbeville County,South Carolina,25417,24722,-0.027344,-2.734390
1,Acadia Parish,Louisiana,61773,62590,0.013226,1.322584
2,Accomack County,Virginia,33164,32545,-0.018665,-1.866482
3,Ada County,Idaho,392365,456849,0.164347,16.434697
4,Adair County,Iowa,7682,7054,-0.081750,-8.174954

In [195]:
pop.columns

Index(['County', 'State', '2010Census', '2017PopEstimate',
       'Percent change 2010 2017'],
      dtype='object')

In [207]:
newpop = pop.drop(['Percent change 2010 2017', '2_percchange'],axis=1)

In [209]:
newpop = newpop.groupby('State').sum()

In [212]:
newpop['PercChange'] = (newpop['2017PopEstimate']-newpop['2010Census'])/newpop['2010Census']

In [214]:
newpop.sort_values('PercChange',ascending=False)

                      2010Census  2017PopEstimate  PercChange
State
District of Columbia      601723           693972    0.153308
Texas                   25145561         28304596    0.125630
North Dakota              672591           755393    0.123109
Utah                     2763885          3101833    0.122273
Florida                 18801310         20984400    0.116114
Colorado                 5029196          5607154    0.114921
Nevada                   2700551          2998039    0.110158
Washington               6724540          7405743    0.101301
Arizona                  6392017          7016270    0.097661
Idaho                    1567582          1716943    0.095281
South Carolina           4625364          5024369    0.086265
Oregon                   3831074          4142776    0.081362
North Carolina           9535483         10273419    0.077388
Georgia                  9687653         10429379    0.076564
Delaware                  897934           961939    0.071280
South Dakota              814180           869666    0.068150
Montana                   989415          1050493    0.061731
California              37253956         39536653    0.061274
Virginia                 8001024          8470020    0.058617
Tennessee                6346105          6715984    0.058284
Minnesota                5303925          5576606    0.051411
Nebraska                 1826341          1920076    0.051324
Hawaii                   1360301          1427538    0.049428
Maryland                 5773552          6052177    0.048259
Oklahoma                 3751351          3930864    0.047853
Massachusetts            6547629          6859819    0.047680
Alaska                    710231           739795    0.041626
Louisiana                4533372          4684333    0.033300
Iowa                     3046355          3145711    0.032615
Arkansas                 2915918          3004279    0.030303
Indiana                  6483802          6666818    0.028227
Wyoming                   563626           579315    0.027836
Kentucky                 4339367          4454189    0.026461
New York                19378102         19849399    0.024321
New Jersey               8791894          9005644    0.024312
Kansas                   2853118          2913123    0.021031
Missouri                 5988927          6113532    0.020806
New Hampshire            1316470          1342795    0.019997
Alabama                  4779736          4874747    0.019878
Wisconsin                5686986          5795483    0.019078
New Mexico               2059179          2088070    0.014030
Ohio                    11536504         11658609    0.010584
Pennsylvania            12702379         12805537    0.008121
Michigan                 9883640          9962311    0.007960
Rhode Island             1052567          1059639    0.006719
Maine                    1328361          1335907    0.005681
Mississippi              2967297          2984100    0.005663
Connecticut              3574097          3588184    0.003941
Illinois                12830632         12802023   -0.002230
Vermont                   625741           623657   -0.003330
West Virginia            1852994          1815857   -0.020042